nxp-mcuxpresso/mcux-sdk/devices/MKE16Z4/MKE16Z4.h
/*! @name CANBTR1 - MSCAN Bus Timing Register 1 */
/*! @{ */
#define MSCAN_CANBTR1_TSEG1_MASK                 (0xFU)
#define MSCAN_CANBTR1_TSEG1_SHIFT                (0U)
/*! TSEG1 - Time Segment 1
 *  0b0000..1 Tq clock cycle (not valid)
 *  0b0001..2 Tq clock cycles (not valid)
 *  0b0010..3 Tq clock cycles (not valid)
 *  0b0011..4 Tq clock cycles
 *  0b1110..15 Tq clock cycles
 *  0b1111..16 Tq clock cycles
 */
#define MSCAN_CANBTR1_TSEG1(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANBTR1_TSEG1_SHIFT)) & MSCAN_CANBTR1_TSEG1_MASK)
#define MSCAN_CANBTR1_TSEG2_MASK                 (0x70U)
#define MSCAN_CANBTR1_TSEG2_SHIFT                (4U)
/*! TSEG2 - Time Segment 2
 *  0b000..1 Tq clock cycle (not valid)
 *  0b001..2 Tq clock cycles
 *  0b010..3 Tq clock cycles
 *  0b011..4 Tq clock cycles
 *  0b100..5 Tq clock cycles
 *  0b101..6 Tq clock cycles
 *  0b110..7 Tq clock cycles
 *  0b111..8 Tq clock cycles
 */
#define MSCAN_CANBTR1_TSEG2(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANBTR1_TSEG2_SHIFT)) & MSCAN_CANBTR1_TSEG2_MASK)
#define MSCAN_CANBTR1_SAMP_MASK                  (0x80U)
#define MSCAN_CANBTR1_SAMP_SHIFT                 (7U)
/*! SAMP - Sampling
 *  0b0..One sample per bit.
 *  0b1..Three samples per bit. In this case, PHASE_SEG1 must be at least 2 time quanta (Tq).
 */
#define MSCAN_CANBTR1_SAMP(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANBTR1_SAMP_SHIFT)) & MSCAN_CANBTR1_SAMP_MASK)
/*! @} */

/*! @name CANRFLG - MSCAN Receiver Flag Register */
/*! @{ */
#define MSCAN_CANRFLG_RXF_MASK                   (0x1U)
#define MSCAN_CANRFLG_RXF_SHIFT                  (0U)
/*! RXF - Receive Buffer Full Flag
 *  0b0..No new message available within the RxFG.
 *  0b1..The receiver FIFO is not empty. A new message is available in the RxFG.
 */
#define MSCAN_CANRFLG_RXF(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRFLG_RXF_SHIFT)) & MSCAN_CANRFLG_RXF_MASK)
#define MSCAN_CANRFLG_OVRIF_MASK                 (0x2U)
#define MSCAN_CANRFLG_OVRIF_SHIFT                (1U)
/*! OVRIF - Overrun Interrupt Flag
 *  0b0..No data overrun condition.
 *  0b1..A data overrun detected.
 */
#define MSCAN_CANRFLG_OVRIF(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRFLG_OVRIF_SHIFT)) & MSCAN_CANRFLG_OVRIF_MASK)
#define MSCAN_CANRFLG_TSTAT_MASK                 (0xCU)
#define MSCAN_CANRFLG_TSTAT_SHIFT                (2U)
/*! TSTAT - Transmitter Status
 *  0b00..TxOK: 0<=transmit error counter<96
 *  0b01..TxWRN: 96<=transmit error counter<128
 *  0b10..TxERR: 128<=transmit error counter<256
 *  0b11..Bus-off: 256<=transmit error counter
 */
#define MSCAN_CANRFLG_TSTAT(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRFLG_TSTAT_SHIFT)) & MSCAN_CANRFLG_TSTAT_MASK)
#define MSCAN_CANRFLG_RSTAT_MASK                 (0x30U)
#define MSCAN_CANRFLG_RSTAT_SHIFT                (4U)
/*! RSTAT - Receiver Status
 *  0b00..RxOK: 0<=receive error counter<96
 *  0b01..RxWRN: 96<=receive error counter<128
 *  0b10..RxERR: 128<=receive error counter
 *  0b11..Bus-off: 256<=transmit error counter (Redundant Information for the most critical CAN bus status which
 *        is "bus-off". This only occurs if the Tx error counter exceeds a number of 255 errors. Bus-off affects the
 *        receiver state. As soon as the transmitter leaves its bus-off state the receiver state skips to RxOK
 *        too. Refer also to TSTAT[1:0] coding in this register. )
 */
#define MSCAN_CANRFLG_RSTAT(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRFLG_RSTAT_SHIFT)) & MSCAN_CANRFLG_RSTAT_MASK)
#define MSCAN_CANRFLG_CSCIF_MASK                 (0x40U)
#define MSCAN_CANRFLG_CSCIF_SHIFT                (6U)
/*! CSCIF - CAN Status Change Interrupt Flag
 *  0b0..No change in CAN bus status occurred since last interrupt.
 *  0b1..MSCAN changed current CAN bus status.
 */
#define MSCAN_CANRFLG_CSCIF(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRFLG_CSCIF_SHIFT)) & MSCAN_CANRFLG_CSCIF_MASK)
#define MSCAN_CANRFLG_WUPIF_MASK                 (0x80U)
#define MSCAN_CANRFLG_WUPIF_SHIFT                (7U)
/*! WUPIF - Wake-Up Interrupt Flag
 *  0b0..No wakeup activity observed while in sleep mode.
 *  0b1..MSCAN detected activity on the CAN bus and requested wakeup.
 */
#define MSCAN_CANRFLG_WUPIF(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRFLG_WUPIF_SHIFT)) & MSCAN_CANRFLG_WUPIF_MASK)
/*! @} */

/*! @name CANRIER - MSCAN Receiver Interrupt Enable Register */
/*! @{ */
#define MSCAN_CANRIER_RXFIE_MASK                 (0x1U)
#define MSCAN_CANRIER_RXFIE_SHIFT                (0U)
/*! RXFIE - Receiver Full Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..A receive buffer full (successful message reception) event causes a receiver interrupt request.
 */
#define MSCAN_CANRIER_RXFIE(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRIER_RXFIE_SHIFT)) & MSCAN_CANRIER_RXFIE_MASK)
#define MSCAN_CANRIER_OVRIE_MASK                 (0x2U)
#define MSCAN_CANRIER_OVRIE_SHIFT                (1U)
/*! OVRIE - Overrun Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..An overrun event causes an error interrupt request.
 */
#define MSCAN_CANRIER_OVRIE(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRIER_OVRIE_SHIFT)) & MSCAN_CANRIER_OVRIE_MASK)
#define MSCAN_CANRIER_TSTATE_MASK                (0xCU)
#define MSCAN_CANRIER_TSTATE_SHIFT               (2U)
/*! TSTATE - Transmitter Status Change Enable
 *  0b00..Do not generate any CSCIF interrupt caused by transmitter state changes.
 *  0b01..Generate CSCIF interrupt only if the transmitter enters or leaves "bus-off" state. Discard other
 *        transmitter state changes for generating CSCIF interrupt.
 *  0b10..Generate CSCIF interrupt only if the transmitter enters or leaves "TxErr" or "bus-off" state. Discard
 *        other transmitter state changes for generating CSCIF interrupt.
 *  0b11..Generate CSCIF interrupt on all state changes.
 */
#define MSCAN_CANRIER_TSTATE(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRIER_TSTATE_SHIFT)) & MSCAN_CANRIER_TSTATE_MASK)
#define MSCAN_CANRIER_RSTATE_MASK                (0x30U)
#define MSCAN_CANRIER_RSTATE_SHIFT               (4U)
/*! RSTATE - Receiver Status Change Enable
 *  0b00..Do not generate any CSCIF interrupt caused by receiver state changes.
 *  0b01..Generate CSCIF interrupt only if the receiver enters or leaves "bus-off" state. Discard other receiver
 *        state changes for generating CSCIF interrupt.
 *  0b10..Generate CSCIF interrupt only if the receiver enters or leaves "RxErr" or "bus-off"Bus-off state is only
 *        defined for transmitters by the CAN standard (see Bosch CAN 2.0A/B protocol specification). Because the
 *        only possible state change for the transmitter from bus-off to TxOK also forces the receiver to skip its
 *        current state to RxOK, the coding of the RXSTAT[1:0] flags define an additional bus-off state for the
 *        receiver state. Discard other receiver state changes for generating CSCIF interrupt.
 *  0b11..Generate CSCIF interrupt on all state changes.
 */
#define MSCAN_CANRIER_RSTATE(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRIER_RSTATE_SHIFT)) & MSCAN_CANRIER_RSTATE_MASK)
#define MSCAN_CANRIER_CSCIE_MASK                 (0x40U)
#define MSCAN_CANRIER_CSCIE_SHIFT                (6U)
/*! CSCIE - CAN Status Change Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..A CAN Status Change event causes an error interrupt request.
 */
#define MSCAN_CANRIER_CSCIE(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRIER_CSCIE_SHIFT)) & MSCAN_CANRIER_CSCIE_MASK)
#define MSCAN_CANRIER_WUPIE_MASK                 (0x80U)
#define MSCAN_CANRIER_WUPIE_SHIFT                (7U)
/*! WUPIE - WakeUp Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..A wake-up event causes a Wake-Up interrupt request.
 */
#define MSCAN_CANRIER_WUPIE(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRIER_WUPIE_SHIFT)) & MSCAN_CANRIER_WUPIE_MASK)
/*! @} */

/*! @name CANTFLG - MSCAN Transmitter Flag Register */
/*! @{ */
#define MSCAN_CANTFLG_TXE_MASK                   (0x7U)
#define MSCAN_CANTFLG_TXE_SHIFT                  (0U)
/*! TXE - Transmitter Buffer Empty
 *  0b000..The associated message buffer is full (loaded with a message due for transmission).
 *  0b001..The associated message buffer is empty (not scheduled).
 */
#define MSCAN_CANTFLG_TXE(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_CANTFLG_TXE_SHIFT)) & MSCAN_CANTFLG_TXE_MASK)
/*! @} */

