nxp-mcuxpresso/mcux-sdk/devices/MKE16Z4/MKE16Z4.h
/*! @name CANTIER - MSCAN Transmitter Interrupt Enable Register */
/*! @{ */
#define MSCAN_CANTIER_TXEIE_MASK                 (0x7U)
#define MSCAN_CANTIER_TXEIE_SHIFT                (0U)
/*! TXEIE - Transmitter Empty Interrupt Enable
 *  0b000..No interrupt request is generated from this event.
 *  0b001..A transmitter empty (transmit buffer available for transmission) event causes a transmitter empty interrupt request.
 */
#define MSCAN_CANTIER_TXEIE(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANTIER_TXEIE_SHIFT)) & MSCAN_CANTIER_TXEIE_MASK)
/*! @} */

/*! @name CANTARQ - MSCAN Transmitter Message Abort Request Register */
/*! @{ */
#define MSCAN_CANTARQ_ABTRQ_MASK                 (0x7U)
#define MSCAN_CANTARQ_ABTRQ_SHIFT                (0U)
/*! ABTRQ - Abort Request
 *  0b000..No abort request.
 *  0b001..Abort request pending.
 */
#define MSCAN_CANTARQ_ABTRQ(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANTARQ_ABTRQ_SHIFT)) & MSCAN_CANTARQ_ABTRQ_MASK)
/*! @} */

/*! @name CANTAAK - MSCAN Transmitter Message Abort Acknowledge Register */
/*! @{ */
#define MSCAN_CANTAAK_ABTAK_MASK                 (0x7U)
#define MSCAN_CANTAAK_ABTAK_SHIFT                (0U)
/*! ABTAK - Abort Acknowledge
 *  0b000..The message was not aborted.
 *  0b001..The message was aborted.
 */
#define MSCAN_CANTAAK_ABTAK(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANTAAK_ABTAK_SHIFT)) & MSCAN_CANTAAK_ABTAK_MASK)
/*! @} */

/*! @name CANTBSEL - MSCAN Transmit Buffer Selection Register */
/*! @{ */
#define MSCAN_CANTBSEL_TX_MASK                   (0x7U)
#define MSCAN_CANTBSEL_TX_SHIFT                  (0U)
/*! TX - Transmit Buffer Select
 *  0b000..The associated message buffer is deselected.
 *  0b001..The associated message buffer is selected, if lowest numbered bit.
 */
#define MSCAN_CANTBSEL_TX(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_CANTBSEL_TX_SHIFT)) & MSCAN_CANTBSEL_TX_MASK)
/*! @} */

/*! @name CANIDAC - MSCAN Identifier Acceptance Control Register */
/*! @{ */
#define MSCAN_CANIDAC_IDHIT_MASK                 (0x7U)
#define MSCAN_CANIDAC_IDHIT_SHIFT                (0U)
/*! IDHIT - Identifier Acceptance Hit Indicator
 *  0b000..Filter 0 hit.
 *  0b001..Filter 1 hit.
 *  0b010..Filter 2 hit.
 *  0b011..Filter 3 hit.
 *  0b100..Filter 4 hit.
 *  0b101..Filter 5 hit.
 *  0b110..Filter 6 hit.
 *  0b111..Filter 7 hit.
 */
#define MSCAN_CANIDAC_IDHIT(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANIDAC_IDHIT_SHIFT)) & MSCAN_CANIDAC_IDHIT_MASK)
#define MSCAN_CANIDAC_IDAM_MASK                  (0x30U)
#define MSCAN_CANIDAC_IDAM_SHIFT                 (4U)
/*! IDAM - Identifier Acceptance Mode
 *  0b00..Two 32-bit acceptance filters.
 *  0b01..Four 16-bit acceptance filters.
 *  0b10..Eight 8-bit acceptance filters.
 *  0b11..Filter closed.
 */
#define MSCAN_CANIDAC_IDAM(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANIDAC_IDAM_SHIFT)) & MSCAN_CANIDAC_IDAM_MASK)
/*! @} */

/*! @name CANMISC - MSCAN Miscellaneous Register */
/*! @{ */
#define MSCAN_CANMISC_BOHOLD_MASK                (0x1U)
#define MSCAN_CANMISC_BOHOLD_SHIFT               (0U)
/*! BOHOLD - Bus-off State Hold Until User Request
 *  0b0..Module is not bus-off or recovery has been requested by user in bus-off state.
 *  0b1..Module is bus-off and holds this state until user request.
 */
#define MSCAN_CANMISC_BOHOLD(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANMISC_BOHOLD_SHIFT)) & MSCAN_CANMISC_BOHOLD_MASK)
/*! @} */

/*! @name CANRXERR - MSCAN Receive Error Counter */
/*! @{ */
#define MSCAN_CANRXERR_RXERR_MASK                (0xFFU)
#define MSCAN_CANRXERR_RXERR_SHIFT               (0U)
/*! RXERR - Receive Error Counter
 */
#define MSCAN_CANRXERR_RXERR(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANRXERR_RXERR_SHIFT)) & MSCAN_CANRXERR_RXERR_MASK)
/*! @} */

/*! @name CANTXERR - MSCAN Transmit Error Counter */
/*! @{ */
#define MSCAN_CANTXERR_TXERR_MASK                (0xFFU)
#define MSCAN_CANTXERR_TXERR_SHIFT               (0U)
/*! TXERR - Transmit Error Counter
 */
#define MSCAN_CANTXERR_TXERR(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANTXERR_TXERR_SHIFT)) & MSCAN_CANTXERR_TXERR_MASK)
/*! @} */

/*! @name CANIDAR_BANK_1 - MSCAN Identifier Acceptance Register n of First Bank */
/*! @{ */
#define MSCAN_CANIDAR_BANK_1_AC_MASK             (0xFFU)
#define MSCAN_CANIDAR_BANK_1_AC_SHIFT            (0U)
/*! AC - Acceptance Code Bits
 */
#define MSCAN_CANIDAR_BANK_1_AC(x)               (((uint8_t)(((uint8_t)(x)) << MSCAN_CANIDAR_BANK_1_AC_SHIFT)) & MSCAN_CANIDAR_BANK_1_AC_MASK)
/*! @} */

/* The count of MSCAN_CANIDAR_BANK_1 */
#define MSCAN_CANIDAR_BANK_1_COUNT               (4U)

/*! @name CANIDMR_BANK_1 - MSCAN Identifier Mask Register n of First Bank */
/*! @{ */
#define MSCAN_CANIDMR_BANK_1_AM_MASK             (0xFFU)
#define MSCAN_CANIDMR_BANK_1_AM_SHIFT            (0U)
/*! AM - Acceptance Mask Bits
 *  0b00000000..Match corresponding acceptance code register and identifier bits.
 *  0b00000001..Ignore corresponding acceptance code register bit.
 */
#define MSCAN_CANIDMR_BANK_1_AM(x)               (((uint8_t)(((uint8_t)(x)) << MSCAN_CANIDMR_BANK_1_AM_SHIFT)) & MSCAN_CANIDMR_BANK_1_AM_MASK)
/*! @} */

/* The count of MSCAN_CANIDMR_BANK_1 */
#define MSCAN_CANIDMR_BANK_1_COUNT               (4U)

/*! @name CANIDAR_BANK_2 - MSCAN Identifier Acceptance Register n of Second Bank */
/*! @{ */
#define MSCAN_CANIDAR_BANK_2_AC_MASK             (0xFFU)
#define MSCAN_CANIDAR_BANK_2_AC_SHIFT            (0U)
/*! AC - Acceptance Code Bits
 */
#define MSCAN_CANIDAR_BANK_2_AC(x)               (((uint8_t)(((uint8_t)(x)) << MSCAN_CANIDAR_BANK_2_AC_SHIFT)) & MSCAN_CANIDAR_BANK_2_AC_MASK)
/*! @} */

/* The count of MSCAN_CANIDAR_BANK_2 */
#define MSCAN_CANIDAR_BANK_2_COUNT               (4U)

/*! @name CANIDMR_BANK_2 - MSCAN Identifier Mask Register n of Second Bank */
/*! @{ */
#define MSCAN_CANIDMR_BANK_2_AM_MASK             (0xFFU)
#define MSCAN_CANIDMR_BANK_2_AM_SHIFT            (0U)
/*! AM - Acceptance Mask Bits
 *  0b00000000..Match corresponding acceptance code register and identifier bits.
 *  0b00000001..Ignore corresponding acceptance code register bit.
 */
#define MSCAN_CANIDMR_BANK_2_AM(x)               (((uint8_t)(((uint8_t)(x)) << MSCAN_CANIDMR_BANK_2_AM_SHIFT)) & MSCAN_CANIDMR_BANK_2_AM_MASK)
/*! @} */

/* The count of MSCAN_CANIDMR_BANK_2 */
#define MSCAN_CANIDMR_BANK_2_COUNT               (4U)

/*! @name REIDR0 - Receive Extended Identifier Register 0 */
/*! @{ */
#define MSCAN_REIDR0_REID28_REID21_MASK          (0xFFU)
#define MSCAN_REIDR0_REID28_REID21_SHIFT         (0U)
/*! REID28_REID21 - Extended Format Identifier
 */
#define MSCAN_REIDR0_REID28_REID21(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR0_REID28_REID21_SHIFT)) & MSCAN_REIDR0_REID28_REID21_MASK)
/*! @} */

/*! @name RSIDR0 - Receive Standard Identifier Register 0 */
/*! @{ */
#define MSCAN_RSIDR0_RSID10_RSID3_MASK           (0xFFU)
#define MSCAN_RSIDR0_RSID10_RSID3_SHIFT          (0U)
/*! RSID10_RSID3 - Standard Format Identifier
 */
#define MSCAN_RSIDR0_RSID10_RSID3(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR0_RSID10_RSID3_SHIFT)) & MSCAN_RSIDR0_RSID10_RSID3_MASK)
/*! @} */

/*! @name REIDR1 - Receive Extended Identifier Register 1 */
/*! @{ */
#define MSCAN_REIDR1_REID17_REID15_MASK          (0x7U)
#define MSCAN_REIDR1_REID17_REID15_SHIFT         (0U)
/*! REID17_REID15 - Extended Format Identifier 17-15
 */
#define MSCAN_REIDR1_REID17_REID15(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_REID17_REID15_SHIFT)) & MSCAN_REIDR1_REID17_REID15_MASK)
#define MSCAN_REIDR1_REIDE_MASK                  (0x8U)
#define MSCAN_REIDR1_REIDE_SHIFT                 (3U)
/*! REIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_REIDR1_REIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_REIDE_SHIFT)) & MSCAN_REIDR1_REIDE_MASK)
#define MSCAN_REIDR1_RSRR_MASK                   (0x10U)
#define MSCAN_REIDR1_RSRR_SHIFT                  (4U)
/*! RSRR - Substitute Remote Request
 */
#define MSCAN_REIDR1_RSRR(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_RSRR_SHIFT)) & MSCAN_REIDR1_RSRR_MASK)
#define MSCAN_REIDR1_REID20_REID18_MASK          (0xE0U)
#define MSCAN_REIDR1_REID20_REID18_SHIFT         (5U)
/*! REID20_REID18 - Extended Format Identifier 20-18
 */
#define MSCAN_REIDR1_REID20_REID18(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_REID20_REID18_SHIFT)) & MSCAN_REIDR1_REID20_REID18_MASK)
/*! @} */

