nxp-mcuxpresso/mcux-sdk/devices/MKE16Z4/MKE16Z4.h
/*! @name MODE - TSI MODE Register */
/*! @{ */
#define TSI_MODE_S_NOISE_MASK                    (0x1U)
#define TSI_MODE_S_NOISE_SHIFT                   (0U)
/*! S_NOISE - S_NOISE
 *  0b0..noise cancellation off.
 *  0b1..noise cancellation on.
 */
#define TSI_MODE_S_NOISE(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_NOISE_SHIFT)) & TSI_MODE_S_NOISE_MASK)
#define TSI_MODE_MODE_MASK                       (0x2U)
#define TSI_MODE_MODE_SHIFT                      (1U)
/*! MODE - MODE
 *  0b0..self-cap mode.
 *  0b1..mutual-cap mode.
 */
#define TSI_MODE_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_MODE_MODE_SHIFT)) & TSI_MODE_MODE_MASK)
#define TSI_MODE_SETCLK_MASK                     (0x60U)
#define TSI_MODE_SETCLK_SHIFT                    (5U)
/*! SETCLK - SETCLK
 *  0b00..20.72MHz.
 *  0b01..16.65MHz.
 *  0b10..13.87MHz.
 *  0b11..11.91MHz.
 */
#define TSI_MODE_SETCLK(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_MODE_SETCLK_SHIFT)) & TSI_MODE_SETCLK_MASK)
#define TSI_MODE_S_XCH_MASK                      (0x7000U)
#define TSI_MODE_S_XCH_SHIFT                     (12U)
/*! S_XCH - S_XCH
 *  0b000..1/16.
 *  0b001..1/8.
 *  0b010..1/4.
 *  0b011..1/2.
 *  0b100..NA.
 *  0b101..NA.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MODE_S_XCH(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_XCH_SHIFT)) & TSI_MODE_S_XCH_MASK)
#define TSI_MODE_S_XIN_MASK                      (0x40000U)
#define TSI_MODE_S_XIN_SHIFT                     (18U)
/*! S_XIN - S_XIN
 *  0b0..1/8.
 *  0b1..1/4.
 */
#define TSI_MODE_S_XIN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_XIN_SHIFT)) & TSI_MODE_S_XIN_MASK)
#define TSI_MODE_S_CTRIM_MASK                    (0x380000U)
#define TSI_MODE_S_CTRIM_SHIFT                   (19U)
/*! S_CTRIM - Capacitor trim setting
 *  0b000..Ctrim=2.5p.
 *  0b001..Ctrim=5.0p.
 *  0b010..Ctrim=7.5p.
 *  0b011..Ctrim=10p.
 *  0b100..Ctrim=12.5p.
 *  0b101..Ctrim=15p.
 *  0b110..Ctrim=17.5p.
 *  0b111..Ctrim=20p.
 */
#define TSI_MODE_S_CTRIM(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_CTRIM_SHIFT)) & TSI_MODE_S_CTRIM_MASK)
#define TSI_MODE_S_SEN_MASK                      (0x400000U)
#define TSI_MODE_S_SEN_SHIFT                     (22U)
/*! S_SEN - S_SEN
 *  0b0..Sensitivity boost off.
 *  0b1..Sensitivity boost on.
 */
#define TSI_MODE_S_SEN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_SEN_SHIFT)) & TSI_MODE_S_SEN_MASK)
#define TSI_MODE_S_W_SHIELD_MASK                 (0x800000U)
#define TSI_MODE_S_W_SHIELD_SHIFT                (23U)
/*! S_W_SHIELD - S_W_SHIELD
 *  0b0..shield switch off.
 *  0b1..shield switch on.
 */
#define TSI_MODE_S_W_SHIELD(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_W_SHIELD_SHIFT)) & TSI_MODE_S_W_SHIELD_MASK)
#define TSI_MODE_S_XDN_MASK                      (0x70000000U)
#define TSI_MODE_S_XDN_SHIFT                     (28U)
/*! S_XDN - S_XDN
 *  0b000..1/16.
 *  0b001..1/8.
 *  0b010..1/4.
 *  0b011..1/2.
 *  0b100..NA.
 *  0b101..NA.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MODE_S_XDN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MODE_S_XDN_SHIFT)) & TSI_MODE_S_XDN_MASK)
/*! @} */

/*! @name MUL0 - TSI MUTUAL-CAP Register 0 */
/*! @{ */
#define TSI_MUL0_M_SEL_RX_MASK                   (0x7U)
#define TSI_MUL0_M_SEL_RX_SHIFT                  (0U)
/*! M_SEL_RX - M_SEL_RX
 *  0b000..select channel 6 as rx6.
 *  0b001..select channel 7 as rx7.
 *  0b010..select channel 8 as rx8.
 *  0b011..select channel 9 as rx9.
 *  0b100..select channel 10 as rx10.
 *  0b101..select channel 11 as rx11.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MUL0_M_SEL_RX(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_SEL_RX_SHIFT)) & TSI_MUL0_M_SEL_RX_MASK)
#define TSI_MUL0_M_SEL_TX_MASK                   (0x70U)
#define TSI_MUL0_M_SEL_TX_SHIFT                  (4U)
/*! M_SEL_TX - M_SEL_TX
 *  0b000..select channel 0 as tx0.
 *  0b001..select channel 1 as tx1.
 *  0b010..select channel 2 as tx2.
 *  0b011..select channel 3 as tx3.
 *  0b100..select channel 4 as tx4.
 *  0b101..select channel 5 as tx5.
 *  0b110..NA.
 *  0b111..NA.
 */
#define TSI_MUL0_M_SEL_TX(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_SEL_TX_SHIFT)) & TSI_MUL0_M_SEL_TX_MASK)
#define TSI_MUL0_M_SEN_RES_MASK                  (0xF00U)
#define TSI_MUL0_M_SEN_RES_SHIFT                 (8U)
/*! M_SEN_RES - M_SEN_RES
 *  0b0000..2.5k.
 *  0b0001..5k.
 *  0b0010..7.5k.
 *  0b0011..10k.
 *  0b0100..12.5k.
 *  0b0101..15k.
 *  0b0110..17.5k.
 *  0b0111..20k.
 *  0b1000..22.5k.
 *  0b1001..25k.
 *  0b1010..27.5k.
 *  0b1011..30k.
 *  0b1100..32.5k.
 *  0b1101..35k.
 *  0b1110..37.5k.
 *  0b1111..40k.
 */
#define TSI_MUL0_M_SEN_RES(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_SEN_RES_SHIFT)) & TSI_MUL0_M_SEN_RES_MASK)
#define TSI_MUL0_M_PRE_RES_MASK                  (0xE000U)
#define TSI_MUL0_M_PRE_RES_SHIFT                 (13U)
/*! M_PRE_RES - M_PRE_RES
 *  0b000..1k.
 *  0b001..2k.
 *  0b010..3k.
 *  0b011..4k.
 *  0b100..5k.
 *  0b101..6k.
 *  0b110..7k.
 *  0b111..8k.
 */
#define TSI_MUL0_M_PRE_RES(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_PRE_RES_SHIFT)) & TSI_MUL0_M_PRE_RES_MASK)
#define TSI_MUL0_M_TX_USED_MASK                  (0x3F0000U)
#define TSI_MUL0_M_TX_USED_SHIFT                 (16U)
/*! M_TX_USED - M_TX_USED
 */
#define TSI_MUL0_M_TX_USED(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_TX_USED_SHIFT)) & TSI_MUL0_M_TX_USED_MASK)
#define TSI_MUL0_M_PRE_CURRENT_MASK              (0xE0000000U)
#define TSI_MUL0_M_PRE_CURRENT_SHIFT             (29U)
/*! M_PRE_CURRENT - M_PRE_CURRENT
 *  0b000..1uA.
 *  0b001..2uA.
 *  0b010..3uA.
 *  0b011..4uA.
 *  0b100..5uA.
 *  0b101..6uA.
 *  0b110..7uA.
 *  0b111..8uA.
 */
#define TSI_MUL0_M_PRE_CURRENT(x)                (((uint32_t)(((uint32_t)(x)) << TSI_MUL0_M_PRE_CURRENT_SHIFT)) & TSI_MUL0_M_PRE_CURRENT_MASK)
/*! @} */

/*! @name MUL1 - TSI MUTUAL-CAP Register 1 */
/*! @{ */
#define TSI_MUL1_M_NMIR_CTRL_MASK                (0x1U)
#define TSI_MUL1_M_NMIR_CTRL_SHIFT               (0U)
/*! M_NMIR_CTRL - M_NMIR_CTRL
 *  0b0..Enable NMOS mirror.
 *  0b1..Disable NMOS mirror.
 */
#define TSI_MUL1_M_NMIR_CTRL(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_NMIR_CTRL_SHIFT)) & TSI_MUL1_M_NMIR_CTRL_MASK)
#define TSI_MUL1_M_NMIRROR_MASK                  (0x6U)
#define TSI_MUL1_M_NMIRROR_SHIFT                 (1U)
/*! M_NMIRROR - M_NMIRROR
 *  0b00..m=1.
 *  0b01..m=2.
 *  0b10..m=3.
 *  0b11..m=4.
 */
#define TSI_MUL1_M_NMIRROR(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_NMIRROR_SHIFT)) & TSI_MUL1_M_NMIRROR_MASK)
#define TSI_MUL1_M_PMIRRORR_MASK                 (0x18U)
#define TSI_MUL1_M_PMIRRORR_SHIFT                (3U)
/*! M_PMIRRORR - M_PMIRRORR
 *  0b00..m=1.
 *  0b01..m=2.
 *  0b10..m=3.
 *  0b11..m=4.
 */
#define TSI_MUL1_M_PMIRRORR(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_PMIRRORR_SHIFT)) & TSI_MUL1_M_PMIRRORR_MASK)
#define TSI_MUL1_M_PMIRRORL_MASK                 (0xE0U)
#define TSI_MUL1_M_PMIRRORL_SHIFT                (5U)
/*! M_PMIRRORL - M_PMIRRORL
 *  0b000..m=4.
 *  0b001..m=8.
 *  0b010..m=12.
 *  0b011..m=16.
 *  0b100..m=20.
 *  0b101..m=24.
 *  0b110..m=28.
 *  0b111..m=32.
 */
#define TSI_MUL1_M_PMIRRORL(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_PMIRRORL_SHIFT)) & TSI_MUL1_M_PMIRRORL_MASK)
#define TSI_MUL1_M_TRIM2_MASK                    (0xFF00U)
#define TSI_MUL1_M_TRIM2_SHIFT                   (8U)
/*! M_TRIM2 - M_TRIM2
 */
#define TSI_MUL1_M_TRIM2(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_TRIM2_SHIFT)) & TSI_MUL1_M_TRIM2_MASK)
#define TSI_MUL1_M_VPRE_CHOOSE_MASK              (0x10000U)
#define TSI_MUL1_M_VPRE_CHOOSE_SHIFT             (16U)
/*! M_VPRE_CHOOSE - M_VPRE_CHOOSE
 *  0b0..Internal 1.2V voltage.
 *  0b1..1.2V PMC output.
 */
#define TSI_MUL1_M_VPRE_CHOOSE(x)                (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_VPRE_CHOOSE_SHIFT)) & TSI_MUL1_M_VPRE_CHOOSE_MASK)
#define TSI_MUL1_M_MODE_MASK                     (0x40000U)
#define TSI_MUL1_M_MODE_SHIFT                    (18U)
/*! M_MODE - M_MODE
 *  0b0..-5V~+5V.
 *  0b1..0V~+5V.
 */
#define TSI_MUL1_M_MODE(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_MODE_SHIFT)) & TSI_MUL1_M_MODE_MASK)
#define TSI_MUL1_M_SEN_BOOST_MASK                (0xF80000U)
#define TSI_MUL1_M_SEN_BOOST_SHIFT               (19U)
/*! M_SEN_BOOST - M_SEN_BOOST
 *  0b00000..0u.
 *  0b00001..2u.
 *  0b00010..4u.
 *  0b00011..6u.
 *  0b00100..8u.
 *  0b00101..10u.
 *  0b00110..12u.
 *  0b00111..14u
 *  0b01000..16u.
 *  0b01001..18u.
 *  0b01010..20u.
 *  0b01011..22u.
 *  0b01100..24u.
 *  0b01101..26u.
 *  0b01110..28u.
 *  0b01111..30u.
 *  0b10000..32u.
 *  0b10001..34u.
 *  0b10010..36u.
 *  0b10011..38u.
 *  0b10100..40u.
 *  0b10101..42u.
 *  0b10110..44u.
 *  0b10111..46u.
 *  0b11000..48u.
 *  0b11001..50u.
 *  0b11010..52u.
 *  0b11011..54u.
 *  0b11100..56u.
 *  0b11101..58u.
 *  0b11110..60u.
 *  0b11111..62u.
 */
#define TSI_MUL1_M_SEN_BOOST(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_MUL1_M_SEN_BOOST_SHIFT)) & TSI_MUL1_M_SEN_BOOST_MASK)
/*! @} */

/*! @name SINC - TSI SINC filter Register */
/*! @{ */
#define TSI_SINC_SSC_CONTROL_OUT_MASK            (0x1U)
#define TSI_SINC_SSC_CONTROL_OUT_SHIFT           (0U)
/*! SSC_CONTROL_OUT - SSC_CONTROL_OUT
 *  0b0..SSC output value is 0.
 *  0b1..SSC output value is 1.
 */
#define TSI_SINC_SSC_CONTROL_OUT(x)              (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SSC_CONTROL_OUT_SHIFT)) & TSI_SINC_SSC_CONTROL_OUT_MASK)
#define TSI_SINC_SINC_VALID_MASK                 (0x2U)
#define TSI_SINC_SINC_VALID_SHIFT                (1U)
/*! SINC_VALID - SINC_VALID
 *  0b0..SINC filter is disabled.
 *  0b1..SINC filter is enabled.
 */
#define TSI_SINC_SINC_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_VALID_SHIFT)) & TSI_SINC_SINC_VALID_MASK)
#define TSI_SINC_SINC_OVERFLOW_FLAG_MASK         (0x4U)
#define TSI_SINC_SINC_OVERFLOW_FLAG_SHIFT        (2U)
/*! SINC_OVERFLOW_FLAG - SINC_OVERFLOW_FLAG
 *  0b0..The counter result has no overflow occurrence in the last scan process.
 *  0b1..The counter result has an overflow occurrence in the last scan process.
 */
#define TSI_SINC_SINC_OVERFLOW_FLAG(x)           (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SINC_OVERFLOW_FLAG_SHIFT)) & TSI_SINC_SINC_OVERFLOW_FLAG_MASK)
#define TSI_SINC_SWITCH_ENABLE_MASK              (0x8U)
#define TSI_SINC_SWITCH_ENABLE_SHIFT             (3U)
/*! SWITCH_ENABLE - SWITCH_ENABLE
 *  0b0..SSC function is disabled.
 *  0b1..SSC function is enabled.
 */
#define TSI_SINC_SWITCH_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << TSI_SINC_SWITCH_ENABLE_SHIFT)) & TSI_SINC_SWITCH_ENABLE_MASK)
#define TSI_SINC_DECIMATION_MASK                 (0x1F0000U)
#define TSI_SINC_DECIMATION_SHIFT                (16U)
/*! DECIMATION - DECIMATION
 *  0b00000..The TSI_DATA[TSICNT] bits is the counter value of 1 scan period.
 *  0b00001..The TSI_DATA[TSICNT] bits is the counter value of 2 scan periods.
 *  0b00010..The TSI_DATA[TSICNT] bits is the counter value of 3 scan periods.
 *  0b00011..The TSI_DATA[TSICNT] bits is the counter value of 4 scan periods.
 *  0b00100..The TSI_DATA[TSICNT] bits is the counter value of 5 scan periods.
 *  0b00101..The TSI_DATA[TSICNT] bits is the counter value of 6 scan periods.
 *  0b00110..The TSI_DATA[TSICNT] bits is the counter value of 7 scan periods.
 *  0b00111..The TSI_DATA[TSICNT] bits is the counter value of 8 scan periods.
 *  0b01000..The TSI_DATA[TSICNT] bits is the counter value of 9 scan periods.
 *  0b01001..The TSI_DATA[TSICNT] bits is the counter value of 10 scan periods.
 *  0b01010..The TSI_DATA[TSICNT] bits is the counter value of 11 scan periods.
 *  0b01011..The TSI_DATA[TSICNT] bits is the counter value of 12 scan periods.
 *  0b01100..The TSI_DATA[TSICNT] bits is the counter value of 13 scan periods.
 *  0b01101..The TSI_DATA[TSICNT] bits is the counter value of 14 scan periods.
 *  0b01110..The TSI_DATA[TSICNT] bits is the counter value of 15 scan periods.
 *  0b01111..The TSI_DATA[TSICNT] bits is the counter value of 16 scan periods.
 *  0b10000..The TSI_DATA[TSICNT] bits is the counter value of 17 scan periods.
 *  0b10001..The TSI_DATA[TSICNT] bits is the counter value of 18 scan periods.
 *  0b10010..The TSI_DATA[TSICNT] bits is the counter value of 19 scan periods.
 *  0b10011..The TSI_DATA[TSICNT] bits is the counter value of 20 scan periods.
 *  0b10100..The TSI_DATA[TSICNT] bits is the counter value of 21 scan periods.
 *  0b10101..The TSI_DATA[TSICNT] bits is the counter value of 22 scan periods.
 *  0b10110..The TSI_DATA[TSICNT] bits is the counter value of 23 scan periods.
 *  0b10111..The TSI_DATA[TSICNT] bits is the counter value of 24 scan periods.
 *  0b11000..The TSI_DATA[TSICNT] bits is the counter value of 25 scan periods.
 *  0b11001..The TSI_DATA[TSICNT] bits is the counter value of 26 scan periods.
 *  0b11010..The TSI_DATA[TSICNT] bits is the counter value of 27 scan periods.
 *  0b11011..The TSI_DATA[TSICNT] bits is the counter value of 28 scan periods.
 *  0b11100..The TSI_DATA[TSICNT] bits is the counter value of 29 scan periods.
 *  0b11101..The TSI_DATA[TSICNT] bits is the counter value of 30 scan periods.
 *  0b11110..The TSI_DATA[TSICNT] bits is the counter value of 31 scan periods.
 *  0b11111..The TSI_DATA[TSICNT] bits is the counter value of 32 scan periods.
 */
#define TSI_SINC_DECIMATION(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_SINC_DECIMATION_SHIFT)) & TSI_SINC_DECIMATION_MASK)
#define TSI_SINC_ORDER_MASK                      (0x200000U)
#define TSI_SINC_ORDER_SHIFT                     (21U)
/*! ORDER - ORDER
 *  0b0..Using 1 order SINC filter.
 *  0b1..Using 2 order SINC filter.
 */
#define TSI_SINC_ORDER(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_SINC_ORDER_SHIFT)) & TSI_SINC_ORDER_MASK)
#define TSI_SINC_CUTOFF_MASK                     (0xF000000U)
#define TSI_SINC_CUTOFF_SHIFT                    (24U)
/*! CUTOFF - CUTOFF
 *  0b0000..div=1.
 *  0b0001..div=2.
 *  0b0010..div=4.
 *  0b0011..div=8.
 *  0b0100..div=16.
 *  0b0101..div=32.
 *  0b0110..div=64.
 *  0b0111..div=128.
 *  0b1000..NC.
 *  0b1001..NC.
 *  0b1010..NC.
 *  0b1011..NC.
 *  0b1100..NC.
 *  0b1101..NC
 *  0b1110..NC.
 *  0b1111..NC.
 */
#define TSI_SINC_CUTOFF(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_SINC_CUTOFF_SHIFT)) & TSI_SINC_CUTOFF_MASK)
/*! @} */

/*! @name SSC0 - TSI SSC Register 0 */
/*! @{ */
#define TSI_SSC0_SSC_PRESCALE_NUM_MASK           (0xFFU)
#define TSI_SSC0_SSC_PRESCALE_NUM_SHIFT          (0U)
/*! SSC_PRESCALE_NUM - SSC_PRESCALE_NUM
 *  0b00000000..div1
 *  0b00000001..div2
 *  0b00000011..div4
 *  0b00000111..div8
 *  0b00001111..div16
 *  0b00011111..div32
 *  0b00111111..div64
 *  0b01111111..div128
 *  0b11111111..div256
 */
#define TSI_SSC0_SSC_PRESCALE_NUM(x)             (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_SSC_PRESCALE_NUM_SHIFT)) & TSI_SSC0_SSC_PRESCALE_NUM_MASK)
#define TSI_SSC0_BASE_NOCHARGE_NUM_MASK          (0xF0000U)
#define TSI_SSC0_BASE_NOCHARGE_NUM_SHIFT         (16U)
/*! BASE_NOCHARGE_NUM - BASE_NOCHARGE_NUM
 *  0b0000..The SSC output bit 1's basic period will be 1 clock cycle of system clock.
 *  0b0001..The SSC output bit 1's basic period will be 2 clock cycles of system clock.
 *  0b0010..The SSC output bit 1's basic period will be 3 clock cycles of system clock.
 *  0b0011..The SSC output bit 1's basic period will be 4 clock cycles of system clock.
 *  0b0100..The SSC output bit 1's basic period will be 5 clock cycles of system clock.
 *  0b0101..The SSC output bit 1's basic period will be 6 clock cycles of system clock.
 *  0b0110..The SSC output bit 1's basic period will be 7 clock cycles of system clock.
 *  0b0111..The SSC output bit 1's basic period will be 8 clock cycles of system clock.
 *  0b1000..The SSC output bit 1's basic period will be 9 clock cycles of system clock.
 *  0b1001..The SSC output bit 1's basic period will be 10 clock cycles of system clock.
 *  0b1010..The SSC output bit 1's basic period will be 11 clock cycles of system clock.
 *  0b1011..The SSC output bit 1's basic period will be 12 clock cycles of system clock.
 *  0b1100..The SSC output bit 1's basic period will be 13 clock cycles of system clock.
 *  0b1101..The SSC output bit 1's basic period will be 14 clock cycles of system clock.
 *  0b1110..The SSC output bit 1's basic period will be 15 clock cycles of system clock.
 *  0b1111..The SSC output bit 1's basic period will be 16 clock cycles of system clock.
 */
#define TSI_SSC0_BASE_NOCHARGE_NUM(x)            (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_BASE_NOCHARGE_NUM_SHIFT)) & TSI_SSC0_BASE_NOCHARGE_NUM_MASK)
#define TSI_SSC0_CHARGE_NUM_MASK                 (0xF00000U)
#define TSI_SSC0_CHARGE_NUM_SHIFT                (20U)
/*! CHARGE_NUM - CHARGE_NUM
 *  0b0000..The SSC output bit 0's period will be 1 clock cycle of system clock.
 *  0b0001..The SSC output bit 0's period will be 2 clock cycles of system clock.
 *  0b0010..The SSC output bit 0's period will be 3 clock cycles of system clock.
 *  0b0011..The SSC output bit 0's period will be 4 clock cycles of system clock.
 *  0b0100..The SSC output bit 0's period will be 5 clock cycles of system clock.
 *  0b0101..The SSC output bit 0's period will be 6 clock cycles of system clock.
 *  0b0110..The SSC output bit 0's period will be 7 clock cycles of system clock.
 *  0b0111..The SSC output bit 0's period will be 8 clock cycles of system clock.
 *  0b1000..The SSC output bit 0's period will be 9 clock cycles of system clock.
 *  0b1001..The SSC output bit 0's period will be 10 clock cycles of system clock.
 *  0b1010..The SSC output bit 0's period will be 11 clock cycles of system clock.
 *  0b1011..The SSC output bit 0's period will be 12 clock cycles of system clock.
 *  0b1100..The SSC output bit 0's period will be 13 clock cycles of system clock.
 *  0b1101..The SSC output bit 0's period will be 14 clock cycles of system clock.
 *  0b1110..The SSC output bit 0's period will be 15 clock cycles of system clock.
 *  0b1111..The SSC output bit 0's period will be 16 clock cycles of system clock.
 */
#define TSI_SSC0_CHARGE_NUM(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_CHARGE_NUM_SHIFT)) & TSI_SSC0_CHARGE_NUM_MASK)
#define TSI_SSC0_SSC_CONTROL_REVERSE_MASK        (0x1000000U)
#define TSI_SSC0_SSC_CONTROL_REVERSE_SHIFT       (24U)
/*! SSC_CONTROL_REVERSE - SSC_CONTROL_REVERSE
 *  0b0..Keep the polarity of the SSC output bit.
 *  0b1..Reverse the polarity of the SSC output bit.
 */
#define TSI_SSC0_SSC_CONTROL_REVERSE(x)          (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_SSC_CONTROL_REVERSE_SHIFT)) & TSI_SSC0_SSC_CONTROL_REVERSE_MASK)
#define TSI_SSC0_SSC_MODE_MASK                   (0x6000000U)
#define TSI_SSC0_SSC_MODE_SHIFT                  (25U)
/*! SSC_MODE - SSC_MODE
 *  0b00..Using PRBS method generating SSC output bit.
 *  0b01..Using up-down counter generating SSC output bit.
 *  0b10..SSC function is disabled.
 *  0b11..NC.
 */
#define TSI_SSC0_SSC_MODE(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_SSC_MODE_SHIFT)) & TSI_SSC0_SSC_MODE_MASK)
#define TSI_SSC0_PRBS_OUTSEL_MASK                (0xF0000000U)
#define TSI_SSC0_PRBS_OUTSEL_SHIFT               (28U)
/*! PRBS_OUTSEL - PRBS_OUTSEL
 *  0b0000..NC.
 *  0b0001..NC.
 *  0b0010..The length of the PRBS is 2.
 *  0b0011..The length of the PRBS is 3.
 *  0b0100..The length of the PRBS is 4.
 *  0b0101..The length of the PRBS is 5.
 *  0b0110..The length of the PRBS is 6.
 *  0b0111..The length of the PRBS is 7.
 *  0b1000..The length of the PRBS is 8.
 *  0b1001..The length of the PRBS is 9.
 *  0b1010..The length of the PRBS is 10.
 *  0b1011..The length of the PRBS is 11.
 *  0b1100..The length of the PRBS is 12.
 *  0b1101..The length of the PRBS is 13.
 *  0b1110..The length of the PRBS is 14.
 *  0b1111..The length of the PRBS is 15.
 */
#define TSI_SSC0_PRBS_OUTSEL(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_SSC0_PRBS_OUTSEL_SHIFT)) & TSI_SSC0_PRBS_OUTSEL_MASK)
/*! @} */

/*! @name SSC1 - TSI SSC Register 1 */
/*! @{ */
#define TSI_SSC1_PRBS_SEED_LO_MASK               (0xFFU)
#define TSI_SSC1_PRBS_SEED_LO_SHIFT              (0U)
/*! PRBS_SEED_LO - PRBS_SEED_LO
 */
#define TSI_SSC1_PRBS_SEED_LO(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_SEED_LO_SHIFT)) & TSI_SSC1_PRBS_SEED_LO_MASK)
#define TSI_SSC1_PRBS_SEED_HI_MASK               (0xFF00U)
#define TSI_SSC1_PRBS_SEED_HI_SHIFT              (8U)
/*! PRBS_SEED_HI - PRBS_SEED_HI
 */
#define TSI_SSC1_PRBS_SEED_HI(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_SEED_HI_SHIFT)) & TSI_SSC1_PRBS_SEED_HI_MASK)
#define TSI_SSC1_PRBS_WEIGHT_LO_MASK             (0xFF0000U)
#define TSI_SSC1_PRBS_WEIGHT_LO_SHIFT            (16U)
/*! PRBS_WEIGHT_LO - PRBS_WEIGHT_LO
 */
#define TSI_SSC1_PRBS_WEIGHT_LO(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_WEIGHT_LO_SHIFT)) & TSI_SSC1_PRBS_WEIGHT_LO_MASK)
#define TSI_SSC1_PRBS_WEIGHT_HI_MASK             (0xFF000000U)
#define TSI_SSC1_PRBS_WEIGHT_HI_SHIFT            (24U)
/*! PRBS_WEIGHT_HI - PRBS_WEIGHT_HI
 */
#define TSI_SSC1_PRBS_WEIGHT_HI(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_WEIGHT_HI_SHIFT)) & TSI_SSC1_PRBS_WEIGHT_HI_MASK)
/*! @} */

